var detail = {
    "阿维尼翁桥": {
        "name": "阿维尼翁桥",
        "type": "石拱桥",
        "list": [
            {
                "type": "石拱桥",
                "location": "法国阿维尼翁罗纳河",
                "info": "圣贝内泽的传说,法国南部著名桥梁",
                "path": "/post/aweiniweng"
            }
        ]
    },
    "布鲁克林大桥": {
        "name": "布鲁克林大桥",
        "type": "大型双塔悬索桥",
        "list": [
            {
                "type": "大型双塔悬索桥",
                "location": "美国纽约州纽约东河",
                "info": "这座桥以其独特的双塔设计和钢缆支撑的桥面而闻名，是纽约市的标志性建筑之一。是当时世界上最长的悬索桥，落成时被认为是继世界古代七大奇迹之后的第八大奇迹，被誉为工业革命时代全世界七个划时代的建筑工程奇迹之一，在1964年成为了美国国家历史地标。", "path": "/post/brooklin"
            }
        ]
    },
    "查理大桥": {
        "name": "查理大桥",
        "type": "哥特式石拱桥",
        "list": [
            {
                "type": "哥特式石拱桥",
                "location": "捷克共和国布拉格市伏尔塔瓦河",
                "info": "欧洲最著名的哥特式桥梁之一，兼具功能与艺术性", "path": "/post/chali"
            }
        ]
    },
    "福斯桥": {
        "name": "福斯桥",
        "type": "大型多跨悬臂钢桁架铁路桥",
        "list": [
            {
                "type": "大型多跨悬臂钢桁架铁路桥",
                "location": "苏格兰福斯河",
                "info": "这座桥以其独特的红色钢结构和历史价值闻名，是工程史上的重要里程碑，于1890年完工，曾是世界上最长的悬臂桥。2015年，福斯桥被联合国教科文组织列为世界文化遗产。", "path": "/post/forth"
            }
        ]
    },
    "加尔桥": {
        "name": "加尔桥",
        "type": "罗马式石拱桥",
        "list": [
            {
                "type": "罗马式石拱桥",
                "location": "法国南部加尔河",
                "info": "历史悠久、保存完好的欧洲古代桥梁，连接了重要的贸易路线", "path": "/post/jiaer"
            }
        ]
    },
    "卡佩尔廊桥": {
        "name": "卡佩尔廊桥",
        "type": "木梁桥",
        "list": [
            {
                "type": "木梁桥",
                "location": "瑞士卢塞恩城罗伊斯河",
                "info": "卢塞恩的明信片,欧洲最古老的有顶木桥", "path": "/post/kapeier"
            }
        ]
    },
    "伦敦塔桥": {
        "name": "伦敦塔桥",
        "type": "垂直升降式双塔悬索桥",
        "list": [
            {
                "type": "垂直升降式双塔悬索桥",
                "location": "英国伦敦泰晤士河",
                "info": "伦敦塔桥，位于英国伦敦，是一座标志性的垂直升降式双塔悬索桥，横跨泰晤士河。这座桥以其独特的双塔设计和可升降的桥面而闻名，是伦敦的地标之一。", "path": "/post/londont"
            }
        ]
    },
    "钱塘江大桥": {
        "name": "钱塘江大桥",
        "type": "双层桁架梁桥",
        "list": [
            {
                "type": "双层桁架梁桥",
                "location": "浙江省杭州市钱塘江",
                "info": "钱塘江大桥是茅以升在20世纪30年代主持设计和建造的中国第一座公铁两用现代化大桥。这座建成于抗日烽火之中的大桥，不仅在中华民族抗击日本侵略者的斗争中书写了可歌可泣的篇章，而且是中国桥梁建筑史上的一座里程碑。", "path": "/post/qiantang"
            }
        ]
    },
    "萨尔基纳山谷桥": {
        "name": "萨尔基纳山谷桥",
        "type": "钢筋混凝土三绞拱桥",
        "list": [
            {
                "type": "钢筋混凝土三绞拱桥",
                "location": "瑞士阿尔卑斯山萨尔基纳河上",
                "info": "20世纪最美的公路桥", "path": "/post/salgina"
            }
        ]
    },
    "史密斯菲尔德街大桥": {
        "name": "史密斯菲尔德街大桥",
        "type": "叶形钢桁架桥",
        "list": [
            {
                "type": "叶形钢桁架桥",
                "location": "美国宾夕法尼亚州匹兹堡市莫农加西拉河",
                "info": "史密斯菲尔德街大桥如今是美国同类型桥梁中最长的，同时也是阿里根尼县（Allegheny County）历史最悠久的桥梁。由於其特别的构造以及重要的历史意义，现在的史密斯菲尔德街大桥已经成为了“美国国家历史全民工程地标", "path": "/post/smf"
            }
        ]
    },
    "塔瓦纳萨桥": {
        "name": "塔瓦纳萨桥",
        "type": "箱型截面三绞拱桥",
        "list": [
            {
                "type": "箱型截面三绞拱桥",
                "location": "瑞士萨尔基纳山谷",
                "info": "结构之新，桥梁之轻", "path": "/post/tawanasa"
            }
        ]
    },
    "瓦伦垂大桥": {
        "name": "瓦伦垂大桥",
        "type": "石拱桥",
        "list": [
            {
                "type": "石拱桥",
                "location": "法国卡奥尔洛特河",
                "info": "法国最美丽的魔鬼桥,中世纪桥梁的杰出代表", "path": "/post/valentre"
            }
        ]
    },
    "维琪奥桥": {
        "name": "维琪奥桥",
        "type": "石拱桥",
        "list": [
            {
                "type": "石拱桥",
                "location": "意大利佛罗伦萨阿尔诺河",
                "info": "佛罗伦萨市的地标,翡冷翠最古老的桥梁", "path": "/post/weiqiao"
            }
        ]
    },
    "中国五亭桥": {
        "name": "中国五亭桥",
        "type": "石拱桥",
        "list": [
            {
                "type": "石拱桥",
                "location": "江苏省扬州市瘦西湖",
                "info": "中国古代典型的园林桥梁之一，极具地方特色的景观桥", "path": "/post/wuting"
            }
        ]
    },
    "赵州桥": {
        "name": "赵州桥",
        "type": "大型单跨圆弧敞肩石拱桥",
        "list": [
            {
                "type": "大型单跨圆弧敞肩石拱桥",
                "location": "河北省石家庄市赵县城南洨河",
                "info": "世界现存年代最久、保存最好、科学水平极高、艺术形象极美的古代石拱桥", "path": "/post/zhaozhou"
            }
        ]
    },
    "佐兹桥": {
        "name": "佐兹桥",
        "type": "三绞拱桥",
        "list": [
            {
                "type": "三绞拱桥",
                "location": "瑞士斯德哥尔摩和骑士岛间的骑士河",
                "info": "钢筋混凝土结构运用的重要尝试", "path": "/post/zuoziqiao"
            }
        ]
    }
}
